#include "collision.h"
#include "global.h"
#include "mission.h"
#include "motion.h"
#include "overworld.h"
#include "sound.h"
#include "weapon.h"
#include "zero.h"

struct RecoilRod {
  OBJECT_HDR;
  // props (56bytes, offset: 0xB4..)
  struct RecoilRodProps {
    struct Zero* z;  // 0xB4
    u8 element;      // 0xB8
    u8 atk;          // 0xB9
    u8 unk_06;       // 0xBA
    u8 comboLv;      // 0xBB
    u8 unk_08;       // 0xBC
    u8 unk_09;       // 0xBD
    u8 unk_0a;       // 0xBE
    u8 unk_0b;       // 0xBF
    u8 unk_0c[8];    // 0xC0
    u8 unk_c8[36];   // 0xC8
  } props;
};
static_assert(sizeof(struct RecoilRod) == sizeof(struct Weapon));

static void onCollision(struct Body* body, struct Coord* r1, struct Coord* r2);

static const u8 gRodElement[4];

struct Weapon* CreateWeaponRod(struct Zero* z) {
  struct RecoilRod* w;
  u8 element;

  KillAllWeapons(DeleteSaber);
  w = (struct RecoilRod*)AllocEntityFirst(gWeaponHeaderPtr);
  if (w != NULL) {
    if ((z->unk_b4).mainCopy == WEAPON_ROD) {
      INIT_WEAPON_ROUTINE(w, WEAPON_MOVE_RECOIL_ROD);
      (w->s).flags2 &= ~ENTITY_FLAGS2_B6;
      (w->s).taskCol = 16;
      (w->s).tileNum = gWeaponTileNum[0];
      (w->s).palID = gWeaponPalIDs[0];
      element = gRodElement[((&z->unk_b4)->status).element];
      SetWeaponElement(0, element);
    } else {
      INIT_WEAPON_ROUTINE(w, WEAPON_MOVE_RECOIL_ROD);
      (w->s).flags2 &= ~ENTITY_FLAGS2_B6;
      (w->s).taskCol = 16;
      (w->s).tileNum = gWeaponTileNum[1];
      (w->s).palID = gWeaponPalIDs[1];
